sofarocean/zephyr/drivers/serial/uart_stm32_bm.c
/*
 * Copyright (c) 2016 Open-RnD Sp. z o.o.
 * Copyright (c) 2016 Linaro Limited.
 * Copyright (c) 2022 Sofar Ocean Technologies
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_uart_bm

/**
 * @brief Driver for UART port on STM32 family processor.
 * @note  LPUART and U(S)ART have the same base and
 *        majority of operations are performed the same way.
 *        Please validate for newly added series.
 */

#include <kernel.h>
#include <arch/cpu.h>
#include <sys/__assert.h>
#include <soc.h>
#include <init.h>
#include <drivers/uart.h>
#include <drivers/clock_control.h>
#include <pm/pm.h>
#include <drivers/gpio.h>
#include <drivers/dma/dma_stm32.h>
#include <drivers/dma.h>

#include <linker/sections.h>
#include <drivers/clock_control/stm32_clock_control.h>
#include "uart_stm32_bm.h"

#include <stm32_ll_usart.h>
#include <stm32_ll_lpuart.h>

#include <logging/log.h>
LOG_MODULE_REGISTER(uart_stm32_bm);

/* This symbol takes the value 1 if one of the device instances */
/* is configured in dts with an optional clock */
#if STM32_DT_INST_DEV_OPT_CLOCK_SUPPORT
#define STM32_UART_OPT_CLOCK_SUPPORT 1
#else
#define STM32_UART_OPT_CLOCK_SUPPORT 0
#endif

#define HAS_LPUART_1 (DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(lpuart1), \
                     st_stm32_lpuart, okay))

#if HAS_LPUART_1
#ifdef USART_PRESC_PRESCALER
uint32_t bm_lpuartdiv_calc(const uint64_t clock_rate, const uint16_t presc_idx,
            const uint32_t baud_rate)
{
    uint64_t lpuartdiv;

    lpuartdiv = clock_rate / LPUART_PRESCALER_TAB[presc_idx];
    lpuartdiv *= LPUART_LPUARTDIV_FREQ_MUL;
    lpuartdiv += baud_rate / 2;
    lpuartdiv /= baud_rate;

    return (uint32_t)lpuartdiv;
}
#else
uint32_t bm_lpuartdiv_calc(const uint64_t clock_rate, const uint32_t baud_rate)
{
    uint64_t lpuartdiv;

    lpuartdiv = clock_rate * LPUART_LPUARTDIV_FREQ_MUL;
    lpuartdiv += baud_rate / 2;
    lpuartdiv /= baud_rate;

    return (uint32_t)lpuartdiv;
}
#endif /* USART_PRESC_PRESCALER */
#endif /* HAS_LPUART_1 */

#define TIMEOUT 1000

#ifdef CONFIG_PM
static void uart_stm32_bm_pm_constraint_set(const struct device *dev)
{
    struct uart_stm32_bm_data *data = dev->data;

    if (!data->pm_constraint_on) {
        data->pm_constraint_on = true;
        pm_constraint_set(PM_STATE_SUSPEND_TO_IDLE);
    }
}

static void uart_stm32_bm_pm_constraint_release(const struct device *dev)
{
    struct uart_stm32_bm_data *data = dev->data;

    if (data->pm_constraint_on) {
        data->pm_constraint_on = false;
        pm_constraint_release(PM_STATE_SUSPEND_TO_IDLE);
    }
}
#endif /* CONFIG_PM */

static inline void uart_stm32_bm_set_baudrate(const struct device *dev,
                       uint32_t baud_rate)
{
    const struct uart_stm32_bm_config *config = dev->config;
    struct uart_stm32_bm_data *data = dev->data;

    uint32_t clock_rate;

    /* Get clock rate */
    if (IS_ENABLED(STM32_UART_OPT_CLOCK_SUPPORT) && (config->pclk_len > 1))
    {
        if (clock_control_get_rate(data->clock,
                       (clock_control_subsys_t)&config->pclken[1],
                       &clock_rate) < 0)
        {
            LOG_ERR("Failed call clock_control_get_rate(pclken[1])");
            return;
        }
    }
    else 
    {
        if (clock_control_get_rate(data->clock,
                       (clock_control_subsys_t)&config->pclken[0],
                       &clock_rate) < 0)
        {
            LOG_ERR("Failed call clock_control_get_rate(pclken[0])");
            return;
        }
    }

#if HAS_LPUART_1
    if (IS_LPUART_INSTANCE(config->usart))
    {
        uint32_t lpuartdiv;
#ifdef USART_PRESC_PRESCALER
        uint8_t presc_idx;
        uint32_t presc_val;

        for (presc_idx = 0; presc_idx < ARRAY_SIZE(LPUART_PRESCALER_TAB); presc_idx++) {
            lpuartdiv = bm_lpuartdiv_calc(clock_rate, presc_idx, baud_rate);
            if (lpuartdiv >= LPUART_BRR_MIN_VALUE && lpuartdiv <= LPUART_BRR_MASK) {
                break;
            }
        }

        if (presc_idx == ARRAY_SIZE(LPUART_PRESCALER_TAB)) {
            LOG_ERR("Unable to set %s to %d", dev->name, baud_rate);
            return;
        }

        presc_val = presc_idx << USART_PRESC_PRESCALER_Pos;

        LL_LPUART_SetPrescaler(config->usart, presc_val);
#else
        lpuartdiv = bm_lpuartdiv_calc(clock_rate, baud_rate);
        if (lpuartdiv < LPUART_BRR_MIN_VALUE || lpuartdiv > LPUART_BRR_MASK)
        {
            LOG_ERR("Unable to set %s to %d", dev->name, baud_rate);
            return;
        }
#endif /* USART_PRESC_PRESCALER */
        LL_LPUART_SetBaudRate(config->usart,
                      clock_rate,
#ifdef USART_PRESC_PRESCALER
                      presc_val,
#endif
                      baud_rate);
    }
    else
    {
#endif /* HAS_LPUART_1 */
#ifdef USART_CR1_OVER8
        LL_USART_SetOverSampling(config->usart,
                     LL_USART_OVERSAMPLING_16);
#endif
        LL_USART_SetBaudRate(config->usart,
                     clock_rate,
#ifdef USART_PRESC_PRESCALER
                     LL_USART_PRESCALER_DIV1,
#endif
#ifdef USART_CR1_OVER8
                     LL_USART_OVERSAMPLING_16,
#endif
                     baud_rate);

#if HAS_LPUART_1
    }
#endif /* HAS_LPUART_1 */
}

static inline void uart_stm32_bm_set_parity(const struct device *dev,
                     uint32_t parity)
{
    const struct uart_stm32_bm_config *config = dev->config;

    LL_USART_SetParity(config->usart, parity);
}

static inline uint32_t uart_stm32_bm_get_parity(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    return LL_USART_GetParity(config->usart);
}

static inline void uart_stm32_bm_set_stopbits(const struct device *dev,
                       uint32_t stopbits)
{
    const struct uart_stm32_bm_config *config = dev->config;

    LL_USART_SetStopBitsLength(config->usart, stopbits);
}

static inline uint32_t uart_stm32_bm_get_stopbits(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    return LL_USART_GetStopBitsLength(config->usart);
}

