sofarocean/zephyr/drivers/serial/uart_stm32_bm.c
static inline void uart_stm32_bm_set_databits(const struct device *dev,
                       uint32_t databits)
{
    const struct uart_stm32_bm_config *config = dev->config;

    LL_USART_SetDataWidth(config->usart, databits);
}

static inline uint32_t uart_stm32_bm_get_databits(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    return LL_USART_GetDataWidth(config->usart);
}

static inline uint32_t uart_stm32_bm_get_hwctrl(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    return LL_USART_GetHWFlowCtrl(config->usart);
}

static inline uint32_t uart_stm32_bm_cfg2ll_parity(enum uart_config_parity parity)
{
    switch (parity)
    {
        case UART_CFG_PARITY_ODD:
            return LL_USART_PARITY_ODD;
        case UART_CFG_PARITY_EVEN:
            return LL_USART_PARITY_EVEN;
        case UART_CFG_PARITY_NONE:
        default:
            return LL_USART_PARITY_NONE;
    }
}

static inline enum uart_config_parity uart_stm32_bm_ll2cfg_parity(uint32_t parity)
{
    switch (parity)
    {
        case LL_USART_PARITY_ODD:
            return UART_CFG_PARITY_ODD;
        case LL_USART_PARITY_EVEN:
            return UART_CFG_PARITY_EVEN;
        case LL_USART_PARITY_NONE:
        default:
            return UART_CFG_PARITY_NONE;
    }
}

static inline uint32_t uart_stm32_bm_cfg2ll_stopbits(enum uart_config_stop_bits sb)
{
    switch (sb)
    {
/* Some MCU's don't support 0.5 stop bits */
#ifdef LL_USART_STOPBITS_0_5
        case UART_CFG_STOP_BITS_0_5:
            return LL_USART_STOPBITS_0_5;
#endif	/* LL_USART_STOPBITS_0_5 */
        case UART_CFG_STOP_BITS_1:
            return LL_USART_STOPBITS_1;
/* Some MCU's don't support 1.5 stop bits */
#ifdef LL_USART_STOPBITS_1_5
        case UART_CFG_STOP_BITS_1_5:
            return LL_USART_STOPBITS_1_5;
#endif	/* LL_USART_STOPBITS_1_5 */
        case UART_CFG_STOP_BITS_2:
        default:
            return LL_USART_STOPBITS_2;
    }
}

static inline enum uart_config_stop_bits uart_stm32_bm_ll2cfg_stopbits(uint32_t sb)
{
    switch (sb)
    {
/* Some MCU's don't support 0.5 stop bits */
#ifdef LL_USART_STOPBITS_0_5
        case LL_USART_STOPBITS_0_5:
            return UART_CFG_STOP_BITS_0_5;
#endif	/* LL_USART_STOPBITS_0_5 */
        case LL_USART_STOPBITS_1:
            return UART_CFG_STOP_BITS_1;
/* Some MCU's don't support 1.5 stop bits */
#ifdef LL_USART_STOPBITS_1_5
        case LL_USART_STOPBITS_1_5:
            return UART_CFG_STOP_BITS_1_5;
#endif	/* LL_USART_STOPBITS_1_5 */
        case LL_USART_STOPBITS_2:
        default:
            return UART_CFG_STOP_BITS_2;
    }
}

static inline enum uart_config_data_bits uart_stm32_bm_ll2cfg_databits(uint32_t db,
                                    uint32_t p)
{
    switch (db)
    {
/* Some MCU's don't support 7B or 9B datawidth */
#ifdef LL_USART_DATAWIDTH_7B
        case LL_USART_DATAWIDTH_7B:
            if (p == LL_USART_PARITY_NONE)
            {
                return UART_CFG_DATA_BITS_7;
            } 
            else
            {
                return UART_CFG_DATA_BITS_6;
            }
#endif	/* LL_USART_DATAWIDTH_7B */
#ifdef LL_USART_DATAWIDTH_9B
        case LL_USART_DATAWIDTH_9B:
            if (p == LL_USART_PARITY_NONE)
            {
                return UART_CFG_DATA_BITS_9;
            }
            else
            {
                return UART_CFG_DATA_BITS_8;
            }
#endif	/* LL_USART_DATAWIDTH_9B */
        case LL_USART_DATAWIDTH_8B:
        default:
            if (p == LL_USART_PARITY_NONE)
            {
                return UART_CFG_DATA_BITS_8;
            } 
            else
            {
                return UART_CFG_DATA_BITS_7;
            }
    }
}

/**
 * @brief  Get LL hardware flow control define from
 *         Zephyr hardware flow control option.
 * @note   Supports only UART_CFG_FLOW_CTRL_RTS_CTS.
 * @param  fc: Zephyr hardware flow control option.
 * @retval LL_USART_HWCONTROL_RTS_CTS, or LL_USART_HWCONTROL_NONE.
 */
static inline uint32_t uart_stm32_bm_cfg2ll_hwctrl(enum uart_config_flow_control fc)
{
    if (fc == UART_CFG_FLOW_CTRL_RTS_CTS)
    {
        return LL_USART_HWCONTROL_RTS_CTS;
    }

    return LL_USART_HWCONTROL_NONE;
}

/**
 * @brief  Get Zephyr hardware flow control option from
 *         LL hardware flow control define.
 * @note   Supports only LL_USART_HWCONTROL_RTS_CTS.
 * @param  fc: LL hardware flow control definition.
 * @retval UART_CFG_FLOW_CTRL_RTS_CTS, or UART_CFG_FLOW_CTRL_NONE.
 */
static inline enum uart_config_flow_control uart_stm32_bm_ll2cfg_hwctrl(uint32_t fc)
{
    if (fc == LL_USART_HWCONTROL_RTS_CTS)
    {
        return UART_CFG_FLOW_CTRL_RTS_CTS;
    }

    return UART_CFG_FLOW_CTRL_NONE;
}

#ifdef CONFIG_UART_USE_RUNTIME_CONFIGURE
static int uart_stm32_bm_configure(const struct device *dev,
                const struct uart_config *cfg)
{
    const struct uart_stm32_bm_config *config = dev->config;
    struct uart_stm32_bm_data *data = dev->data;
    const uint32_t parity = uart_stm32_bm_cfg2ll_parity(cfg->parity);
    const uint32_t stopbits = uart_stm32_bm_cfg2ll_stopbits(cfg->stop_bits);

    /* Hardware doesn't support mark or space parity */
    if ((cfg->parity == UART_CFG_PARITY_MARK) ||
        (cfg->parity == UART_CFG_PARITY_SPACE))
    {
        return -ENOTSUP;
    }

    /* Driver does not supports parity + 9 databits */
    if ((cfg->parity != UART_CFG_PARITY_NONE) &&
        (cfg->data_bits == UART_CFG_DATA_BITS_9))
    {
        return -ENOTSUP;
    }

#if defined(LL_USART_STOPBITS_0_5) && HAS_LPUART_1
    if (IS_LPUART_INSTANCE(config->usart) &&
        (cfg->stop_bits == UART_CFG_STOP_BITS_0_5))
    {
        return -ENOTSUP;
    }
#else
    if (cfg->stop_bits == UART_CFG_STOP_BITS_0_5)
    {
        return -ENOTSUP;
    }
#endif

#if defined(LL_USART_STOPBITS_1_5) && HAS_LPUART_1
    if (IS_LPUART_INSTANCE(config->usart) &&
        (cfg->stop_bits == UART_CFG_STOP_BITS_1_5))
    {
        return -ENOTSUP;
    }
#else
    if (cfg->stop_bits == UART_CFG_STOP_BITS_1_5)
    {
        return -ENOTSUP;
    }
#endif

    /* Driver doesn't support 5 or 6 databits and potentially 7 or 9 */
    if ((cfg->data_bits == UART_CFG_DATA_BITS_5) ||
        (cfg->data_bits == UART_CFG_DATA_BITS_6)
#ifndef LL_USART_DATAWIDTH_7B
        || (cfg->data_bits == UART_CFG_DATA_BITS_7)
#endif /* LL_USART_DATAWIDTH_7B */
        || (cfg->data_bits == UART_CFG_DATA_BITS_9))
    {
        return -ENOTSUP;
    }

    /* Driver supports only RTS CTS flow control */
    if (cfg->flow_ctrl != UART_CFG_FLOW_CTRL_NONE)
    {
        if (!IS_UART_HWFLOW_INSTANCE(config->usart) ||
            UART_CFG_FLOW_CTRL_RTS_CTS != cfg->flow_ctrl)
        {
            return -ENOTSUP;
        }
    }

    LL_USART_Disable(config->usart);

