sofarocean/zephyr/drivers/serial/uart_stm32_bm.c
    if (parity != uart_stm32_bm_get_parity(dev))
    {
        uart_stm32_bm_set_parity(dev, parity);
    }

    if (stopbits != uart_stm32_bm_get_stopbits(dev))
    {
        uart_stm32_bm_set_stopbits(dev, stopbits);
    }

    if (cfg->baudrate != data->baud_rate)
    {
        uart_stm32_bm_set_baudrate(dev, cfg->baudrate);
        data->baud_rate = cfg->baudrate;
    }

    LL_USART_Enable(config->usart);
    return 0;
};

static int uart_stm32_bm_config_get(const struct device *dev,
                 struct uart_config *cfg)
{
    struct uart_stm32_bm_data *data = dev->data;

    cfg->baudrate = data->baud_rate;
    cfg->parity = uart_stm32_bm_ll2cfg_parity(uart_stm32_bm_get_parity(dev));
    cfg->stop_bits = uart_stm32_bm_ll2cfg_stopbits(
        uart_stm32_bm_get_stopbits(dev));
    cfg->data_bits = uart_stm32_bm_ll2cfg_databits(
        uart_stm32_bm_get_databits(dev), uart_stm32_bm_get_parity(dev));
    cfg->flow_ctrl = uart_stm32_bm_ll2cfg_hwctrl(
        uart_stm32_bm_get_hwctrl(dev));
    return 0;
}
#endif /* CONFIG_UART_USE_RUNTIME_CONFIGURE */

static int uart_stm32_bm_err_check(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;
    uint32_t err = 0U;

    /* Check for errors, then clear them.
     * Some SoC clear all error flags when at least
     * one is cleared. (e.g. F4X, F1X, and F2X).
     * The stm32 F4X, F1X, and F2X also reads the usart DR when clearing Errors
     */
    if (LL_USART_IsActiveFlag_ORE(config->usart))
    {
        err |= UART_ERROR_OVERRUN;
    }

    if (LL_USART_IsActiveFlag_PE(config->usart))
    {
        err |= UART_ERROR_PARITY;
    }

    if (LL_USART_IsActiveFlag_FE(config->usart))
    {
        err |= UART_ERROR_FRAMING;
    }

#if !defined(CONFIG_SOC_SERIES_STM32F0X) || defined(USART_LIN_SUPPORT)
    if (LL_USART_IsActiveFlag_LBD(config->usart))
    {
        err |= UART_BREAK;
    }

    if (err & UART_BREAK)
    {
        LL_USART_ClearFlag_LBD(config->usart);
    }
#endif
    /* Clearing error :
     * the stm32 F4X, F1X, and F2X sw sequence is reading the usart SR
     * then the usart DR to clear the Error flags ORE, PE, FE, NE
     * --> so is the RXNE flag also cleared !
     */
    if (err & UART_ERROR_OVERRUN)
    {
        LL_USART_ClearFlag_ORE(config->usart);
    }

    if (err & UART_ERROR_PARITY)
    {
        LL_USART_ClearFlag_PE(config->usart);
    }

    if (err & UART_ERROR_FRAMING)
    {
        LL_USART_ClearFlag_FE(config->usart);
    }
    /* Clear noise error as well,
     * it is not represented by the errors enum
     */
    LL_USART_ClearFlag_NE(config->usart);

    return err;
}

static inline void __uart_stm32_bm_get_clock(const struct device *dev)
{
    struct uart_stm32_bm_data *data = dev->data;
    const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

    data->clock = clk;
}

static int uart_stm32_bm_fifo_read(const struct device *dev, uint8_t *rx_data,
                  const int size)
{
    const struct uart_stm32_bm_config *config = dev->config;
    uint8_t num_rx = 0U;

    while ((size - num_rx > 0) &&
           LL_USART_IsActiveFlag_RXNE(config->usart))
    {
        /* Receive a character (8bit , parity none) */
        rx_data[num_rx++] = LL_USART_ReceiveData8(config->usart);

        /* Clear overrun error flag */
        if (LL_USART_IsActiveFlag_ORE(config->usart))
        {
            LL_USART_ClearFlag_ORE(config->usart);
        }
    }

    return num_rx;
}

static void uart_stm32_bm_irq_tx_enable(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;
#ifdef CONFIG_PM
    struct uart_stm32_bm_data *data = dev->data;
    int key;
#endif

#ifdef CONFIG_PM
    key = irq_lock();
    data->tx_poll_stream_on = false;
    data->tx_int_stream_on = true;
    uart_stm32_bm_pm_constraint_set(dev);
#endif
    LL_USART_EnableIT_TC(config->usart);

#ifdef CONFIG_PM
    irq_unlock(key);
#endif
}

static void uart_stm32_bm_irq_tx_disable(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;
#ifdef CONFIG_PM
    struct uart_stm32_bm_data *data = dev->data;
    int key;

    key = irq_lock();
#endif

    LL_USART_DisableIT_TC(config->usart);

#ifdef CONFIG_PM
    data->tx_int_stream_on = false;
    uart_stm32_bm_pm_constraint_release(dev);
#endif

#ifdef CONFIG_PM
    irq_unlock(key);
#endif
}

static int uart_stm32_bm_irq_tx_ready(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    return LL_USART_IsActiveFlag_TXE(config->usart) &&
        LL_USART_IsEnabledIT_TC(config->usart);
}

static int uart_stm32_bm_irq_tx_complete(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    return LL_USART_IsActiveFlag_TC(config->usart);
}

static void uart_stm32_bm_irq_rx_enable(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    LL_USART_EnableIT_RXNE(config->usart);
}

static void uart_stm32_bm_irq_rx_disable(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    LL_USART_DisableIT_RXNE(config->usart);
}

static int uart_stm32_bm_irq_rx_ready(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;
    /*
     * On stm32 F4X, F1X, and F2X, the RXNE flag is affected (cleared) by
     * the uart_err_check function call (on errors flags clearing)
     */
    return LL_USART_IsActiveFlag_RXNE(config->usart);
}

static void uart_stm32_bm_irq_err_enable(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    /* Enable FE, ORE interruptions */
    LL_USART_EnableIT_ERROR(config->usart);
#if !defined(CONFIG_SOC_SERIES_STM32F0X) || defined(USART_LIN_SUPPORT)
    /* Enable Line break detection */
    if (IS_UART_LIN_INSTANCE(config->usart))
    {
        LL_USART_EnableIT_LBD(config->usart);
    }
#endif
    /* Enable parity error interruption */
    LL_USART_EnableIT_PE(config->usart);
}

static void uart_stm32_bm_irq_err_disable(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    /* Disable FE, ORE interruptions */
    LL_USART_DisableIT_ERROR(config->usart);
#if !defined(CONFIG_SOC_SERIES_STM32F0X) || defined(USART_LIN_SUPPORT)
    /* Disable Line break detection */
    if (IS_UART_LIN_INSTANCE(config->usart))
    {
        LL_USART_DisableIT_LBD(config->usart);
    }
#endif
    /* Disable parity error interruption */
    LL_USART_DisableIT_PE(config->usart);
}

