sofarocean/zephyr/drivers/serial/uart_stm32_bm.c
static int uart_stm32_bm_irq_is_pending(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    return ((LL_USART_IsActiveFlag_RXNE(config->usart) &&
         LL_USART_IsEnabledIT_RXNE(config->usart)) ||
        (LL_USART_IsActiveFlag_TC(config->usart) &&
         LL_USART_IsEnabledIT_TC(config->usart)));
}

static int uart_stm32_bm_irq_update(const struct device *dev)
{
    return 1;
}

static void uart_stm32_bm_irq_callback_set(const struct device *dev,
                    uart_irq_callback_user_data_t cb,
                    void *cb_data)
{
    struct uart_stm32_bm_data *data = dev->data;

    data->user_cb = cb;
    data->user_data = cb_data;
}

static inline void async_user_callback(struct uart_stm32_bm_data *data,
                struct uart_event *event)
{
    if (data->async_cb)
    {
        data->async_cb(data->uart_dev, event, data->async_user_data);
    }
}

static inline void async_evt_rx_rdy(struct uart_stm32_bm_data *data)
{
    struct uart_event event =
    {
        .type = UART_RX_RDY,
        .data.rx.buf = data->dma_rx.buffer,
        .data.rx.len = data->dma_rx.counter,
        .data.rx.offset = data->dma_rx.offset
    };

    async_user_callback(data, &event);
}

static inline void async_evt_rx_err(struct uart_stm32_bm_data *data, int err_code)
{
    struct uart_event event =
    {
        .type = UART_RX_STOPPED,
        .data.rx_stop.reason = err_code,
        .data.rx_stop.data.len = data->dma_rx.counter,
        .data.rx_stop.data.offset = 0,
        .data.rx_stop.data.buf = data->dma_rx.buffer
    };

    async_user_callback(data, &event);
}

static inline void async_evt_tx_done(struct uart_stm32_bm_data *data)
{
    struct uart_event event =
    {
        .type = UART_TX_DONE,
        .data.tx.buf = data->dma_tx.buffer,
        .data.tx.len = data->dma_tx.counter
    };

    /* Reset tx buffer */
    data->dma_tx.buffer_length = 0;
    data->dma_tx.counter = 0;

    async_user_callback(data, &event);
}

static inline void async_evt_tx_abort(struct uart_stm32_bm_data *data)
{
    struct uart_event event =
    {
        .type = UART_TX_ABORTED,
        .data.tx.buf = data->dma_tx.buffer,
        .data.tx.len = data->dma_tx.counter
    };

    /* Reset tx buffer */
    data->dma_tx.buffer_length = 0;
    data->dma_tx.counter = 0;

    async_user_callback(data, &event);
}

static inline void async_evt_rx_buf_request(struct uart_stm32_bm_data *data)
{
    struct uart_event evt = 
    {
        .type = UART_RX_BUF_REQUEST,
    };

    async_user_callback(data, &evt);
}

static inline void async_evt_rx_buf_release(struct uart_stm32_bm_data *data)
{
    struct uart_event evt = 
    {
        .type = UART_RX_BUF_RELEASED,
        .data.rx_buf.buf = data->dma_rx.buffer,
    };

    async_user_callback(data, &evt);
}

static inline void async_timer_start(struct k_work_delayable *work,
                     int32_t timeout)
{
    if ((timeout != SYS_FOREVER_US) && (timeout != 0))
    {
        /* start timer */
        k_work_reschedule(work, K_USEC(timeout));
    }
}

static void uart_stm32_bm_dma_rx_flush(const struct device *dev)
{
    size_t pos;
    struct dma_status stat;
    struct uart_stm32_bm_data *data = dev->data;

    if (dma_get_status(data->dma_rx.dma_dev, data->dma_rx.dma_channel, &stat) == 0) 
    {
        pos = data->dma_rx.buffer_length - stat.pending_length;
        data->dma_rx.counter = pos;

        async_evt_rx_rdy(data);

        /* Save current position as offset */
        data->dma_rx.offset = pos;

        /* Check and manually update if we reached end of buffer */
        if (data->dma_rx.offset == data->dma_rx.buffer_length) 
        {
            data->dma_rx.offset = 0;
        }
    }
}

static void uart_stm32_bm_isr(const struct device *dev)
{
    struct uart_stm32_bm_data *data = dev->data;
    const struct uart_stm32_bm_config *config = dev->config;

    if (data->user_cb) 
    {
        data->user_cb(dev, data->user_data);
    }

    if (LL_USART_IsEnabledIT_IDLE(config->usart) && LL_USART_IsActiveFlag_IDLE(config->usart))
    {
        LL_USART_ClearFlag_IDLE(config->usart);
        uart_stm32_bm_dma_rx_flush(dev);
    } 
    else if (LL_USART_IsEnabledIT_TC(config->usart) && LL_USART_IsActiveFlag_TC(config->usart))
    {
        LL_USART_DisableIT_TC(config->usart);
        LL_USART_ClearFlag_TC(config->usart);
        /* Generate TX_DONE event when transmission is done */
        async_evt_tx_done(data);
    } 
    else if (LL_USART_IsEnabledIT_RXNE(config->usart) && LL_USART_IsActiveFlag_RXNE(config->usart))
    {
        /* clear the RXNE by flushing the fifo, because Rx data was not read */
        LL_USART_RequestRxDataFlush(config->usart);
    }
    /* Clear errors */
    uart_stm32_bm_err_check(dev);
}

static int uart_stm32_bm_async_callback_set(const struct device *dev,
                     uart_callback_t callback,
                     void *user_data)
{
    struct uart_stm32_bm_data *data = dev->data;

    data->async_cb = callback;
    data->async_user_data = user_data;

    return 0;
}

static inline void uart_stm32_bm_dma_tx_enable(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    LL_USART_EnableDMAReq_TX(config->usart);
}

static inline void uart_stm32_bm_dma_tx_disable(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;

    LL_USART_DisableDMAReq_TX(config->usart);
}

static inline void uart_stm32_bm_dma_rx_enable(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;
    struct uart_stm32_bm_data *data = dev->data;

    LL_USART_EnableDMAReq_RX(config->usart);

    data->dma_rx.enabled = true;
}

static inline void uart_stm32_bm_dma_rx_disable(const struct device *dev)
{
    struct uart_stm32_bm_data *data = dev->data;

    data->dma_rx.enabled = false;
}

static int uart_stm32_bm_async_rx_disable(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;
    struct uart_stm32_bm_data *data = dev->data;
    struct uart_event disabled_event = 
    {
        .type = UART_RX_DISABLED
    };

    if (!data->dma_rx.enabled)
    {
        async_user_callback(data, &disabled_event);
        return -EFAULT;
    }

