sofarocean/zephyr/drivers/serial/uart_stm32_bm.c
    LL_USART_DisableIT_IDLE(config->usart);

    uart_stm32_bm_dma_rx_flush(dev);

    async_evt_rx_buf_release(data);

    uart_stm32_bm_dma_rx_disable(dev);

    (void)k_work_cancel_delayable(&data->dma_rx.timeout_work);

    dma_stop(data->dma_rx.dma_dev, data->dma_rx.dma_channel);

    /* When async rx is disabled, enable interruptable instance of uart to function normally*/
    LL_USART_EnableIT_RXNE(config->usart);

    LOG_DBG("rx: disabled");

    async_user_callback(data, &disabled_event);

    return 0;
}

void uart_stm32_bm_dma_tx_cb(const struct device *dma_dev, void *user_data,
                   uint32_t channel, int status)
{
    const struct device *uart_dev = user_data;
    struct uart_stm32_bm_data *data = uart_dev->data;
    struct dma_status stat;
    unsigned int key = irq_lock();

    /* Disable TX */
    uart_stm32_bm_dma_tx_disable(uart_dev);

    (void)k_work_cancel_delayable(&data->dma_tx.timeout_work);

    if (!dma_get_status(data->dma_tx.dma_dev,
                data->dma_tx.dma_channel, &stat))
    {
        data->dma_tx.counter = data->dma_tx.buffer_length -
                    stat.pending_length;
    }

    data->dma_tx.buffer_length = 0;

    irq_unlock(key);
}

void uart_stm32_bm_dma_rx_cb(const struct device *dma_dev, void *user_data,
                   uint32_t channel, int status)
{
    const struct device *uart_dev = user_data;
    struct uart_stm32_bm_data *data = uart_dev->data;

    /* Check for error */
    if (status != 0)
    {
        async_evt_rx_err(data, status);
        return;
    }
}

static int uart_stm32_bm_async_tx(const struct device *dev,
        const uint8_t *tx_data, size_t buf_size, int32_t timeout)
{
    const struct uart_stm32_bm_config *config = dev->config;
    struct uart_stm32_bm_data *data = dev->data;
    int ret;

    if (data->dma_tx.dma_dev == NULL)
    {
        return -ENODEV;
    }

    if (data->dma_tx.buffer_length != 0)
    {
        return -EBUSY;
    }

    data->dma_tx.buffer = (uint8_t *)tx_data;
    data->dma_tx.buffer_length = buf_size;
    data->dma_tx.timeout = timeout;

    LOG_DBG("tx: l=%d", data->dma_tx.buffer_length);

    /* Clear TC flag */
    LL_USART_ClearFlag_TC(config->usart);

    /* Enable TC interrupt so we can signal correct TX done */
    LL_USART_EnableIT_TC(config->usart);

    /* set source address */
    data->dma_tx.blk_cfg.source_address = (uint32_t)data->dma_tx.buffer;
    data->dma_tx.blk_cfg.block_size = data->dma_tx.buffer_length;

    ret = dma_config(data->dma_tx.dma_dev, data->dma_tx.dma_channel,
                &data->dma_tx.dma_cfg);

    if (ret != 0)
    {
        LOG_ERR("dma tx config error!");
        return -EINVAL;
    }

    if (dma_start(data->dma_tx.dma_dev, data->dma_tx.dma_channel))
    {
        LOG_ERR("UART err: TX DMA start failed!");
        return -EFAULT;
    }

    /* Start TX timer */
    async_timer_start(&data->dma_tx.timeout_work, data->dma_tx.timeout);

#ifdef CONFIG_PM

    /* Do not allow system to suspend until transmission has completed */
    uart_stm32_bm_pm_constraint_set(dev);
#endif

    /* Enable TX DMA requests */
    uart_stm32_bm_dma_tx_enable(dev);

    return 0;
}

static int uart_stm32_bm_async_rx_enable(const struct device *dev,
        uint8_t *rx_buf, size_t buf_size, int32_t timeout)
{
    const struct uart_stm32_bm_config *config = dev->config;
    struct uart_stm32_bm_data *data = dev->data;
    int ret;

    if (data->dma_rx.dma_dev == NULL)
    {
        return -ENODEV;
    }

    if (data->dma_rx.enabled)
    {
        LOG_WRN("RX was already enabled");
        return -EBUSY;
    }

    data->dma_rx.offset = 0;
    data->dma_rx.buffer = rx_buf;
    data->dma_rx.buffer_length = buf_size;
    data->dma_rx.counter = 0;
    data->dma_rx.timeout = timeout;

    /* Disable RX interrupts to let DMA to handle it */
    LL_USART_DisableIT_RXNE(config->usart);

    data->dma_rx.blk_cfg.block_size = buf_size;
    data->dma_rx.blk_cfg.dest_address = (uint32_t)data->dma_rx.buffer;

    ret = dma_config(data->dma_rx.dma_dev, data->dma_rx.dma_channel,
                &data->dma_rx.dma_cfg);

    if (ret != 0)
    {
        LOG_ERR("UART ERR: RX DMA config failed!");
        return -EINVAL;
    }

    if (dma_start(data->dma_rx.dma_dev, data->dma_rx.dma_channel))
    {
        LOG_ERR("UART ERR: RX DMA start failed!");
        return -EFAULT;
    }

    /* Enable RX DMA requests */
    uart_stm32_bm_dma_rx_enable(dev);

    /* Enable IRQ IDLE to define the end of a
     * RX DMA transaction.
     */
    LL_USART_ClearFlag_IDLE(config->usart);
    LL_USART_EnableIT_IDLE(config->usart);

    LL_USART_EnableIT_ERROR(config->usart);

    return ret;
}

static int uart_stm32_bm_async_tx_abort(const struct device *dev)
{
    struct uart_stm32_bm_data *data = dev->data;
    size_t tx_buffer_length = data->dma_tx.buffer_length;
    struct dma_status stat;

    if (tx_buffer_length == 0)
    {
        return -EFAULT;
    }

    (void)k_work_cancel_delayable(&data->dma_tx.timeout_work);
    if (!dma_get_status(data->dma_tx.dma_dev, data->dma_tx.dma_channel, &stat))
    {
        data->dma_tx.counter = tx_buffer_length - stat.pending_length;
    }

    dma_stop(data->dma_tx.dma_dev, data->dma_tx.dma_channel);
    async_evt_tx_abort(data);

    return 0;
}

static void uart_stm32_bm_async_tx_timeout(struct k_work *work)
{
    struct k_work_delayable *dwork = k_work_delayable_from_work(work);
    struct uart_stm32_bm_dma_stream *tx_stream = CONTAINER_OF(dwork,
            struct uart_stm32_bm_dma_stream, timeout_work);
    struct uart_stm32_bm_data *data = CONTAINER_OF(tx_stream,
            struct uart_stm32_bm_data, dma_tx);
    const struct device *dev = data->uart_dev;

    uart_stm32_bm_async_tx_abort(dev);
    LOG_DBG("tx: async timeout");
}

static int uart_stm32_bm_async_init(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;
    struct uart_stm32_bm_data *data = dev->data;

    data->uart_dev = dev;

    if (data->dma_rx.dma_dev != NULL)
    {
        if (!device_is_ready(data->dma_rx.dma_dev))
        {
            return -ENODEV;
        }
    }

    if (data->dma_tx.dma_dev != NULL)
    {
        if (!device_is_ready(data->dma_rx.dma_dev))
        {
            return -ENODEV;
        }
    }

    /* Disable both TX and RX DMA requests */
    uart_stm32_bm_dma_rx_disable(dev);
    uart_stm32_bm_dma_tx_disable(dev);

    k_work_init_delayable(&data->dma_tx.timeout_work,
                uart_stm32_bm_async_tx_timeout);

    /* Configure dma rx config */
    memset(&data->dma_rx.blk_cfg, 0, sizeof(data->dma_rx.blk_cfg));

    data->dma_rx.blk_cfg.source_address = LL_USART_DMA_GetRegAddr(config->usart, LL_USART_DMA_REG_DATA_RECEIVE);

    data->dma_rx.blk_cfg.dest_address = 0; /* dest not ready */

    if (data->dma_rx.src_addr_increment)
    {
        data->dma_rx.blk_cfg.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
    } 
    else
    {
        data->dma_rx.blk_cfg.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
    }

