sofarocean/zephyr/drivers/serial/uart_stm32_bm.c
    if (data->dma_rx.dst_addr_increment)
    {
        data->dma_rx.blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
    }
    else
    {
        data->dma_rx.blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
    }

    /* Explicity enable RX circular buffer */
    data->dma_rx.blk_cfg.source_reload_en  = 1;
    data->dma_rx.blk_cfg.dest_reload_en = 1;
    data->dma_rx.blk_cfg.fifo_mode_control = data->dma_rx.fifo_threshold;

    data->dma_rx.dma_cfg.head_block = &data->dma_rx.blk_cfg;
    data->dma_rx.dma_cfg.user_data = (void *)dev;

    /* Configure dma tx config */
    memset(&data->dma_tx.blk_cfg, 0, sizeof(data->dma_tx.blk_cfg));

    data->dma_tx.blk_cfg.dest_address = LL_USART_DMA_GetRegAddr(config->usart,LL_USART_DMA_REG_DATA_TRANSMIT);

    data->dma_tx.blk_cfg.source_address = 0; /* not ready */

    if (data->dma_tx.src_addr_increment)
    {
        data->dma_tx.blk_cfg.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
    }
    else
    {
        data->dma_tx.blk_cfg.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
    }

    if (data->dma_tx.dst_addr_increment)
    {
        data->dma_tx.blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
    }
    else
    {
        data->dma_tx.blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
    }

    data->dma_tx.blk_cfg.fifo_mode_control = data->dma_tx.fifo_threshold;

    data->dma_tx.dma_cfg.head_block = &data->dma_tx.blk_cfg;
    data->dma_tx.dma_cfg.user_data = (void *)dev;

    return 0;
}

static const struct uart_driver_api uart_stm32_bm_driver_api =
{
    .poll_in = NULL,
    .poll_out = NULL,
    .err_check = uart_stm32_bm_err_check,
#ifdef CONFIG_UART_USE_RUNTIME_CONFIGURE
    .configure = uart_stm32_bm_configure,
    .config_get = uart_stm32_bm_config_get,
#endif /* CONFIG_UART_USE_RUNTIME_CONFIGURE */
    .fifo_fill = NULL,
    .fifo_read = uart_stm32_bm_fifo_read,
    .irq_tx_enable = uart_stm32_bm_irq_tx_enable,
    .irq_tx_disable = uart_stm32_bm_irq_tx_disable,
    .irq_tx_ready = uart_stm32_bm_irq_tx_ready,
    .irq_tx_complete = uart_stm32_bm_irq_tx_complete,
    .irq_rx_enable = uart_stm32_bm_irq_rx_enable,
    .irq_rx_disable = uart_stm32_bm_irq_rx_disable,
    .irq_rx_ready = uart_stm32_bm_irq_rx_ready,
    .irq_err_enable = uart_stm32_bm_irq_err_enable,
    .irq_err_disable = uart_stm32_bm_irq_err_disable,
    .irq_is_pending = uart_stm32_bm_irq_is_pending,
    .irq_update = uart_stm32_bm_irq_update,
    .irq_callback_set = uart_stm32_bm_irq_callback_set,
    .callback_set = uart_stm32_bm_async_callback_set,
    .tx = uart_stm32_bm_async_tx,
    .tx_abort = uart_stm32_bm_async_tx_abort,
    .rx_enable = uart_stm32_bm_async_rx_enable,
    .rx_disable = uart_stm32_bm_async_rx_disable,
};

/**
 * @brief Initialize UART channel
 *
 * This routine is called to reset the chip in a quiescent state.
 * It is assumed that this function is called only once per UART.
 *
 * @param dev UART device struct
 *
 * @return 0
 */
static int uart_stm32_bm_init(const struct device *dev)
{
    const struct uart_stm32_bm_config *config = dev->config;
    struct uart_stm32_bm_data *data = dev->data;
    uint32_t ll_parity;
    uint32_t ll_datawidth;
    int err;

    __uart_stm32_bm_get_clock(dev);
    /* enable clock */
    err = clock_control_on(data->clock, (clock_control_subsys_t)&config->pclken[0]);
    if (err != 0) {
        LOG_ERR("Could not enable (LP)UART clock");
        return err;
    }

    if (IS_ENABLED(STM32_UART_OPT_CLOCK_SUPPORT) && (config->pclk_len > 1)) {
        err = clock_control_configure(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
                          (clock_control_subsys_t) &config->pclken[1],
                          NULL);
        if (err != 0) {
            LOG_ERR("Could not select UART source clock");
            return err;
        }
    }

    /* Configure dt provided device signals when available */
    err = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
    if (err < 0)
    {
        return err;
    }

    LL_USART_Disable(config->usart);

    /* TX/RX direction */
    LL_USART_SetTransferDirection(config->usart,
                      LL_USART_DIRECTION_TX_RX);

    /* Determine the datawidth and parity. If we use other parity than
     * 'none' we must use datawidth = 9 (to get 8 databit + 1 parity bit).
     */
    if (config->parity == 2)
    {
        /* 8 databit, 1 parity bit, parity even */
        ll_parity = LL_USART_PARITY_EVEN;
        ll_datawidth = LL_USART_DATAWIDTH_9B;
    } 
    else if (config->parity == 1)
    {
        /* 8 databit, 1 parity bit, parity odd */
        ll_parity = LL_USART_PARITY_ODD;
        ll_datawidth = LL_USART_DATAWIDTH_9B;
    }
    else
    {  /* Default to 8N0, but show warning if invalid value */
        if (config->parity != 0)
        {
            LOG_WRN("Invalid parity setting '%d'."
                "Defaulting to 'none'.", config->parity);
        }
        /* 8 databit, parity none */
        ll_parity = LL_USART_PARITY_NONE;
        ll_datawidth = LL_USART_DATAWIDTH_8B;
    }

    /* Set datawidth and parity, 1 start bit, 1 stop bit  */
    LL_USART_ConfigCharacter(config->usart,
                 ll_datawidth,
                 ll_parity,
                 LL_USART_STOPBITS_1);

    /* Set the default baudrate */
    uart_stm32_bm_set_baudrate(dev, data->baud_rate);

    LL_USART_Enable(config->usart);

#ifdef USART_ISR_TEACK
    /* Wait until TEACK flag is set */
    while (!(LL_USART_IsActiveFlag_TEACK(config->usart))) {
    }
#endif /* !USART_ISR_TEACK */

#ifdef USART_ISR_REACK
    /* Wait until REACK flag is set */
    while (!(LL_USART_IsActiveFlag_REACK(config->usart))) {
    }
#endif /* !USART_ISR_REACK */

#if defined(CONFIG_PM) || \
    defined(CONFIG_UART_INTERRUPT_DRIVEN) || \
    defined(CONFIG_UART_ASYNC_API)
    config->irq_config_func(dev);
#endif /* CONFIG_PM || CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API */

#ifdef CONFIG_UART_ASYNC_API
    return uart_stm32_bm_async_init(dev);
#else
    return 0;
#endif
}

#ifdef CONFIG_UART_ASYNC_API

