sofarocean/zephyr/drivers/serial/uart_stm32_bm.c
/* src_dev and dest_dev should be 'MEMORY' or 'PERIPHERAL'. */
#define UART_DMA_CHANNEL_INIT(index, dir, dir_cap, src_dev, dest_dev)	\
    .dma_dev = DEVICE_DT_GET(STM32_DMA_CTLR(index, dir)),			\
    .dma_channel = DT_INST_DMAS_CELL_BY_NAME(index, dir, channel),	\
    .dma_cfg = {							\
        .dma_slot = STM32_DMA_SLOT(index, dir, slot),\
        .channel_direction = STM32_DMA_CONFIG_DIRECTION(	\
                    STM32_DMA_CHANNEL_CONFIG(index, dir)),\
        .channel_priority = STM32_DMA_CONFIG_PRIORITY(		\
                STM32_DMA_CHANNEL_CONFIG(index, dir)),	\
        .source_data_size = STM32_DMA_CONFIG_##src_dev##_DATA_SIZE(\
                    STM32_DMA_CHANNEL_CONFIG(index, dir)),\
        .dest_data_size = STM32_DMA_CONFIG_##dest_dev##_DATA_SIZE(\
                STM32_DMA_CHANNEL_CONFIG(index, dir)),\
        .source_burst_length = 1, /* SINGLE transfer */		\
        .dest_burst_length = 1,					\
        .block_count = 1,					\
        .dma_callback = uart_stm32_bm_dma_##dir##_cb,		\
    },								\
    .src_addr_increment = STM32_DMA_CONFIG_##src_dev##_ADDR_INC(	\
                STM32_DMA_CHANNEL_CONFIG(index, dir)),	\
    .dst_addr_increment = STM32_DMA_CONFIG_##dest_dev##_ADDR_INC(	\
                STM32_DMA_CHANNEL_CONFIG(index, dir)),	\
    .fifo_threshold = STM32_DMA_FEATURES_FIFO_THRESHOLD(		\
                STM32_DMA_FEATURES(index, dir)),		\

#endif

#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API) || \
    defined(CONFIG_PM)
#define BM_UART_IRQ_HANDLER_DECL(index)				\
    static void uart_stm32_bm_irq_config_func_##index(const struct device *dev);
#define BM_UART_IRQ_HANDLER(index)					\
static void uart_stm32_bm_irq_config_func_##index(const struct device *dev)	\
{									\
    IRQ_CONNECT(DT_INST_IRQN(index),				\
        DT_INST_IRQ(index, priority),				\
        uart_stm32_bm_isr, DEVICE_DT_INST_GET(index),		\
        0);							\
    irq_enable(DT_INST_IRQN(index));				\
}
#else
#define BM_UART_IRQ_HANDLER_DECL(index) /* Not used */
#define BM_UART_IRQ_HANDLER(index) /* Not used */
#endif

#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API) || \
    defined(CONFIG_PM)
#define BM_UART_IRQ_HANDLER_FUNC(index)				\
    .irq_config_func = uart_stm32_bm_irq_config_func_##index,
#else
#define BM_UART_IRQ_HANDLER_FUNC(index) /* Not used */
#endif

#ifdef CONFIG_UART_ASYNC_API
#define UART_DMA_CHANNEL(index, dir, DIR, src, dest)			\
.dma_##dir = {				\
    COND_CODE_1(DT_INST_DMAS_HAS_NAME(index, dir),			\
         (UART_DMA_CHANNEL_INIT(index, dir, DIR, src, dest)),	\
         (NULL))				\
    },

#else
#define UART_DMA_CHANNEL(index, dir, DIR, src, dest)
#endif

#define BM_UART_INIT(index)						\
BM_UART_IRQ_HANDLER_DECL(index)					\
                                    \
PINCTRL_DT_INST_DEFINE(index);						\
                                    \
static const struct stm32_pclken pclken_##index[] =			\
                        STM32_DT_INST_CLOCKS(index);\
                                    \
static const struct uart_stm32_bm_config uart_stm32_bm_cfg_##index = {	\
    .usart = (USART_TypeDef *)DT_INST_REG_ADDR(index),		\
    .pclken = pclken_##index,					\
    .pclk_len = DT_INST_NUM_CLOCKS(index),				\
    .parity = DT_INST_ENUM_IDX_OR(index, parity, UART_CFG_PARITY_NONE),	\
    .pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),			\
    BM_UART_IRQ_HANDLER_FUNC(index)				\
};									\
                                    \
static struct uart_stm32_bm_data uart_stm32_bm_data_##index = {		\
    .baud_rate = DT_INST_PROP(index, current_speed),		\
    UART_DMA_CHANNEL(index, rx, RX, PERIPHERAL, MEMORY)		\
    UART_DMA_CHANNEL(index, tx, TX, MEMORY, PERIPHERAL)		\
};									\
                                    \
DEVICE_DT_INST_DEFINE(index,						\
            &uart_stm32_bm_init,					\
            NULL,						\
            &uart_stm32_bm_data_##index, &uart_stm32_bm_cfg_##index,	\
            PRE_KERNEL_1, CONFIG_SERIAL_INIT_PRIORITY,		\
            &uart_stm32_bm_driver_api);				\
                                    \
BM_UART_IRQ_HANDLER(index)

DT_INST_FOREACH_STATUS_OKAY(BM_UART_INIT)